In [35]:
import pandas as pd

In [4]:
course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']
duration = [2,3,6,4]

In [6]:
df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})

In [7]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

Q1. Write a code to print the data present in the second row of the dataframe, df.

In [8]:
df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?

iloc uses index and loc uses labels

Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df
then find the output for both new_df.loc[2] and new_df.iloc[2].

In [9]:
reindex = [3,0,1,2]

In [10]:
new_df = df.reindex(reindex)

In [11]:
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [12]:
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [13]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

we can see when loc is placed then the reault is given as per label
while when we used iloc it run accoding to  the index

In [14]:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [15]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.499918  0.466331  0.834774  0.431702  0.120114  0.999464
2  0.767019  0.647247  0.005945  0.038844  0.682560  0.674167
3  0.841848  0.765902  0.560688  0.075991  0.812989  0.289876
4  0.837723  0.224883  0.288257  0.464714  0.727465  0.285533
5  0.856953  0.159492  0.281349  0.054189  0.405217  0.601861
6  0.992253  0.905587  0.890201  0.845987  0.409826  0.961733

Q4. Write a code to find the following statistical measurements for the above dataframe df1:

(i) mean of each and every column present in the dataframe.

(ii) standard deviation of column, ‘column_2’

In [17]:
df1.describe().mean()

column_1    1.366642
column_2    1.183735
column_3    1.149209
column_4    1.036953
column_5    1.173643
column_6    1.265889
dtype: float64

In [19]:
df1.describe().std()

column_1    1.890104
column_2    1.961674
column_3    1.979257
column_4    2.021199
column_5    1.963141
column_6    1.930778
dtype: float64

Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the mean of column, column_2.

If you are getting errors in executing it then explain why.
[Hint: To replace the data use df1.loc[] and equate this to string data of your choice.]

In [20]:
str_data= ['a','b','c','d','e','f']

In [21]:
df1.

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.499918  0.466331  0.834774  0.431702  0.120114  0.999464
2  0.767019  0.647247  0.005945  0.038844  0.682560  0.674167
3  0.841848  0.765902  0.560688  0.075991  0.812989  0.289876
4  0.837723  0.224883  0.288257  0.464714  0.727465  0.285533
5  0.856953  0.159492  0.281349  0.054189  0.405217  0.601861
6  0.992253  0.905587  0.890201  0.845987  0.409826  0.961733

In [32]:
df1.drop(['column_2'],axis=1,inplace=True)

In [33]:
df1

   column_1  column_3  column_4  column_5  column_6
1  0.499918  0.834774  0.431702  0.120114  0.999464
2  0.767019  0.005945  0.038844  0.682560  0.674167
3  0.841848  0.560688  0.075991  0.812989  0.289876
4  0.837723  0.288257  0.464714  0.727465  0.285533
5  0.856953  0.281349  0.054189  0.405217  0.601861
6  0.992253  0.890201  0.845987  0.409826  0.961733

Q6. What do you understand about the windows function in pandas and list the types of windows
functions?

Window funtion gives the a chancel to peform the function

Q7. Write a code to print only the current month and year at the time of answering this question.
[Hint: Use pandas.datetime function]

Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and
calculates the difference between them in days, hours, and minutes using Pandas time delta. The
program should prompt the user to enter the dates and display the result.